namespace LYTest.DAL.DataBaseView
{
    /// 检定结论类型的枚举
    /// <summary>
    /// 检定结论类型的枚举
    /// </summary>
    public enum EnumViewDataBase
    {
        载波试验=1,
        启动潜动试验=2,
        基本误差试验=3,
        标准偏差=4,
        走字试验=5,
        通讯规约检查=6,
        日计时误差=7,
        费率时段检查=8,
        时段投切=9,
        费率时段电能示值误差=10,
        计度器示值组合误差=11,
        误差一致性=12,
        误差变差=13,
        负载电流升降变差=14,
        电流过载=15,
        费控结论=16,
        ESAM数据回抄=17,
        功能结论=18,
        计量功能=19,
        计时功能=20,
        费率时段功能=21,
        脉冲输出功能=22,
        最大需量功能=23,
        显示功能=24,
        事件结论=25,
        编程事件=26,
        清零事件=27,
        失压事件=28,
        失流事件=29,
        断相事件=30,
        过载事件=31,
        掉电事件=32,
        开盖事件=33,
        逆相序事件=34,
        开端钮盖事件=35,
        表信息=36,
        多功能试验结论=37,
        特殊检定=38,
        耐压试验=39,
        功耗试验=40,
        台体信息=41,
        参数录入=42
    }
}
