namespace LYTest.Core.Enum
{
    /// <summary>
    /// 加密机相关试验类型
    /// </summary>
    public enum Cus_EncryptionTrialType
    {
        身份认证 = 001,
        远程拉闸 = 002,
        远程合闸 = 003,
        远程保电 = 004,
        解除保电 = 005,
        远程报警 = 006,
        解除报警 = 007,
        密钥更新 = 008,
        电量清零 = 009,
        ESAM数据回抄 = 010,
        密钥恢复 = 011,
        主控密钥更新 = 012,
        远程密钥更新 = 013,
        参数密钥更新 = 014,
        身份密钥更新 = 015,
        融通秘钥更新 = 016,
        直接合闸 = 017,
        密钥更新_01 = 018,
        密钥更新_02 = 019,
        密钥更新_03 = 020,
        密钥更新_04 = 021,
        密钥更新_05 = 022,
        密钥恢复_01 = 023,
        密钥恢复_02 = 024,
        密钥恢复_03 = 025,
        密钥恢复_04 = 026,
        密钥恢复_05 = 027,
        密钥更新_698 = 028,
        密钥恢复_698 = 029,
    }
}
