
namespace LYTest.DAL.Config
{
    /// 配置编号枚举
    /// <summary>
    /// 配置编号枚举
    /// </summary>
    public enum EnumConfigId
    {

        未知编号配置 = 0,

        #region 装置信息
        基本信息 = 01001,
        地区信息 = 01002,
        显示设置 = 01003,
        日志设置 = 01004,
        #endregion

        #region 检定设置

        标准器设置 = 02001,
        多功能检定配置 = 02002,
        检定有效期 = 02003,
        检定配置 = 02004,
        出厂编号配置 = 02005,
        蓝牙光电模式配置 = 02006,
        电机配置 = 02007,
        检定过程配置 = 02008,
        特殊配置 = 02009,

        错误报警数 = 02011,
        人工台和流水线设置 = 02012,
        通信地址配置 = 02013,
        证书编号配置 = 02014,
        资产编号配置 = 02015,
        #endregion

        #region 营销接口
        平台接口配置 = 03001,
        营销接口配置 = 03002,
        #endregion

        #region 加密机
        加密机配置 = 04001,
        #endregion

        #region 网络信息
        集控线配置 = 05001,
        工控平台上报 = 5002,
        #endregion

        //#region 仪表编号
        //南网设备统一接口 = 1022,
        //南网读写卡器统一接口 = 1023,

        //RS485 = 1020,
        //#endregion

        //#region 台体基本信息
        //台体基本信息 = 2001,
        //#endregion

        //#region 软件配置
        //运行环境 = 03001,
        //出厂编号配置 = 03002,
        //标准表常数 = 03003,
        //标准表固定常数值 = 03004,
        //通讯方式 = 03005,
        //#endregion

        //#region 检定相关的服务
        //服务地址配置 = 05001,
        //#endregion

        //#region 加密机
        //加密机配置 = 07001,
        //#endregion

        //#region 检定控制
        //设备特殊配置 = 08001,

        //#endregion

        //#region 营销接口
        //平台数据库配置 = 09001,
        //WebService配置 = 09002,
        //检定结论服务地址 = 09003
        //#endregion
    }
}